<?php
/**
 * O(f(n)*f(g)) => O(f(nˆ2)) - общий случай
 * n, g - number of elements
 * В данном алгоритме будет 100 * 7 = 700 итераций
 */
$n = 100;
$array[]= [];

for ($i = 0; $i < $n; $i++) { // тут 100 итераций
    for ($j = 1; $j < $n; $j *= 2) { // n не должно превышать 100, 2ˆx = 64 (после 64 идет 128) => x = 7 итераций
        $array[$i][$j]= true;
    }
}

/**
 * O(f(n / 2)*f(n)) => O(f(nˆ2)) - общий случай
 * n - number of elements
 * В данном алгоритме будет 100 * 50 = 5000 итераций
 */

$n = 100;
$array[] = [];

for ($i = 0; $i < $n; $i += 2) { // 100 / 2 = 50 итераций
    for ($j = $i; $j < $n; $j++) { // 100 итераций
        $array[$i][$j]= true;
    }
}
